Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F31C.tmx
Source language: en_us
Languages: zh_cn

source: The saddle saga: warm showers and hot meals
zh_cn: 单车传奇：想往热水浴和热饭热菜

source: As Matt and I continue our journey, the on-the-road conversations move between the same subjects again and again: the steepness of the hills, food, how ridiculously hot it is (we are English, so it would be wrong not to mention the weather), food, inconsiderate motorists, food and all the small things that we miss.
zh_cn: 随着我和迈特 麦克道纳德继续着我们的旅程，旅途上交谈的内容总是离不开同样的话题：如山坡的坡度，食物，天气热得不像话，（我们是英国人，不可能不谈天气）食物，鲁莽的开车人，食物，以及我们所想念的一切琐事。

source: Chief amongst these is warm showers.
zh_cn: 在所有的事情里，最想念的是冲凉。

source: Riding heavily-laden bikes through undulating countryside in scorching temperatures without this luxury began to get us down.
zh_cn: 在灼热的气温下骑着载重自行车行进在乡间起伏的道路上，没有冲凉这种奢侈享受我们简直受不了。

source: Thank God then, for Marino wool. This helps to keep us stink-free. Although we do whiff a little of damp sheep after a long day in the saddle, this is preferable to the alternative and allows us to blend in with the farming communities of the Ardennes and Alsace regions of France and Belgium.
zh_cn: 感谢上帝我们身上穿的是美利奴羊毛衫，它能使我们身体的气味不那么难闻，尽管在一天的长途骑行后，我们身上有那么一股潮湿绵羊的味道。但这总比臭气熏人要好得多，使我们在法国比利时边界的阿登和阿尔萨斯地区，还能混迹到当地的农民中间。

source: It was after eight days along the hilly roadways of Luxembourg when we decided that we couldn't bear to wash in another road-side toilet.
zh_cn: 在卢森堡的山路上骑行了八天之后，我们感到再也不能忍受在路边的厕所里草草洗刷我们自己了。

source: We searched for somewhere to pitch our tents and eventually found Kockleschuer campsite, 2.5 miles from Luxembourg city.
zh_cn: 我们想找一个能搭帐篷的地方，结果在离卢森堡市2.5英里的地方找到了考克斯齐营地。

source: That first shower was bliss.
zh_cn: 第一次淋浴舒服级了。

source: As I stood underneath the tepid jet, watching the dirty brown water disappear down the plug, it felt as if each drop was sent from heaven.
zh_cn: 我站在温热的水柱里，看着棕色的脏水流入到排水沟中，感到每一滴洗澡水简直都是来自天堂。

source: It was amazing how such a simple thing lifted our outlook.
zh_cn: 洗澡这样一件简单的事情也能提升我们的境界，使我感到颇为惊奇。

source: Tough as it was to leave behind the showers, we had to move on - but, as it turned out, to even more comfort.
zh_cn: 尽管如此，我们还是不得不离开淋浴房继续前进，但是没想到却到了更加舒服的地方。

source: Next stop was Strasbourg, where two of our Facebook fans had arranged a free hotel room for us, giving us the opportunity to stroll around the UNESCO-listed cobbled streets by night and to sleep in soft, comfy beds.
zh_cn: 我们的下一站是斯特拉斯堡，我们在Facebook上的两位粉丝为我们安排了免费的旅馆房间，晚上我们能睡在柔软舒适的床铺上。在傍晚的时候我们还有机会在鹅卵石铺就的街道上闲逛，这里的街道可是联合国教科文组织命名过的。

source: We were sorry to leave after just one night as we felt that there was much more to see, but Munich beckoned.
zh_cn: 我们感到这里一定有更多的东西可看，所以为只呆了一夜就离开而感到很遗憾。但是慕尼黑在召唤了。

source: The next morning we demolished the breakfast buffet before making our way across the Rhine to take on the Baden hills of the Schwarzwald.
zh_cn: 次日一早我们用过自助早餐，跨过莱茵河后开始在黑森林巴登山区骑行。

source: Here we encountered the first long, steep climb of the trip from the town of Bad Griesbach ("Bad" means "Spa" in German, not, "Lookout! There's a horrendously steep hill to climb in a bit!").
zh_cn: 在过了巴特格里斯巴赫之后，我们遇到了第一个长距离的陡坡。在德语中，巴特是“温泉”的意思。“看，前面又是一道可怕的陡坡！”

source: The climb had sneaked up on us and, before we knew it, we were huffing and puffing up a 12 per cent incline that stretched on for miles.
zh_cn: 我们一点点往上爬坡，在不知不觉中已经气喘吁吁地爬上了一个有几英里长，坡度达12%的山坡。

source: With legs of jelly and drenched in sheep-scented sweat, we reached the 3,000-foot summit.
zh_cn: 当我们终于登上3,000英尺高的山顶时双腿发软，身上被绵羊气味的汗水所浸透。

source: It was thrilling to have managed such a steep climb in the heat - plus we now had an equally steep downhill stretch to look forward to.
zh_cn: 能在酷热中登上如此陡峭的山坡是一件很刺激的事情，加上我们还面对着同样长而陡的下坡路。

source: The remaining journey to Munich was a dream: well-signed and flat cycle routes blazed a trail so easy to follow that we were able to ride the 125 miles from Ulm to Munich in one day.
zh_cn: 在前往慕尼黑的旅途中，余下的旅程如梦一般美妙：平坦而标识清楚的自行车专用道，使我们轻而易举地在一天的时间里完成了从乌尔姆到慕尼黑的125英里旅程。

source: Arriving in the city, we met the Bunting family who had graciously offered us beds for the duration of our stay, giving us the chance to explore the famous Bavarian beer gardens (which we did with gusto).
zh_cn: 到了慕尼黑后我们遇到了博恩丁一家人，他们慷慨地为我们提供了在慕尼黑期间的住宿地，还使我们有机会参观了著名的巴伐利亚啤酒花园，我们自然看得津津有味。

source: Leaving Bavaria we were once again treated to flat roads, easy-to-follow cycle paths, courteous drivers and the warmth of an Indian summer.
zh_cn: 在离开巴伐利亚的时候，我们又一次骑行在平坦而易于识别的自行车专用道上，驾车人都很彬彬有礼，天气像印度一般炎热。

source: We hoped that our good fortune would continue into the decidedly less flat regions of the Austrian Alps; as the cloud-tipped mountains on the horizon grew closer, though, that hope began to diminish.
zh_cn: 我们希望如此好运能延续到奥地利不再那么平坦的阿尔卑斯山区，但是当地平线上被乌云笼罩的高山越来越近时，我们的希望也开始变得渺茫了。
